# data-database-types-relational-language-SQL-MySQL-function-built-in-string-CONCAT
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **joins** **two** **strings** **together** [1]

```sql
mysql> use lab5;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab5 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+----------+------+------+-----------+
| personID | name     | age  | sex  | isStudent |
+----------+----------+------+------+-----------+
|        1 | John     |   24 | M    |         1 |
|        2 | Mary     |   31 | F    |         0 |
|        3 | Tom      | NULL | M    |         0 |
|        4 | Alan     |   19 | M    |         1 |
|        5 | Laura    |   18 | F    |         1 |
|        6 | Bob      |   19 | M    |         0 |
|        7 | Johnny   |   24 | M    |         1 |
|        8 | Mary     |   31 | F    |         0 |
|        9 | Jonathan |   24 | M    |         0 |
|       10 | Tommy    |   24 | M    |         0 |
+----------+----------+------+------+-----------+
10 rows in set (0.00 sec)
```

- **update** **table** - entity - relation - person - **include** - Mr. - Ms. - in **each** **row** - record - tuple - in the **column** - attribute - field - name [1]

- first check current row - record - tuple - value - before setting to a new value - **function** - **IF** - **three** **expressions** - i) **first** expression - **test** for - **True** - **False** - column - attribute - field - sex equals - M - ii) **second** expression - **value** to **return** if the **first** expression - **True**  - Mr. - iii) **third** expression - **value** to **return** if the **first** expression - **False** - Ms. [1]

- value returned from - function - IF - either - Mr. - Ms. - **function** - **CONCAT** - **joins** **two** **strings** together - **parameters** - two - i) **first** - **result** of running **function** - **IF** - ii) **second** - the **original** **column** - attribute - field - name [1]

```sql
mysql> UPDATE person
    -> SET name=CONCAT(IF(sex="M","Mr.","Ms."),name);
Query OK, 10 rows affected (0.01 sec)
Rows matched: 10  Changed: 10  Warnings: 0
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------------+------+------+-----------+
| personID | name        | age  | sex  | isStudent |
+----------+-------------+------+------+-----------+
|        1 | Mr.John     |   24 | M    |         1 |
|        2 | Ms.Mary     |   31 | F    |         0 |
|        3 | Mr.Tom      | NULL | M    |         0 |
|        4 | Mr.Alan     |   19 | M    |         1 |
|        5 | Ms.Laura    |   18 | F    |         1 |
|        6 | Mr.Bob      |   19 | M    |         0 |
|        7 | Mr.Johnny   |   24 | M    |         1 |
|        8 | Ms.Mary     |   31 | F    |         0 |
|        9 | Mr.Jonathan |   24 | M    |         0 |
|       10 | Mr.Tommy    |   24 | M    |         0 |
+----------+-------------+------+------+-----------+
10 rows in set (0.00 sec)
```

***
# END